Revit 2027 API
Reference.CreateReferenceInLink Method
Creates a Reference in an RVT Link from a Reference in the RVT host file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference CreateReferenceInLink()
Public Function CreateReferenceInLink As Reference
public:
Reference^ CreateReferenceInLink()
member CreateReferenceInLink : unit -> Reference
Return Value
Reference
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace